aguo/ruki/app/controllers/wiki_controller.rb

SELECT "wiki_pages".* FROM "wiki_pages" WHERE "wiki_pages"."name" = 'HomePage' LIMIT 1
---
        if params[:wiki_page][:name].strip == ""
          err_msg += t('Please input page name') + '</br>'
        end
        unless WikiPages.page_all.
                 where(:project_id => params[:project_id]).
                 where(:name => params[:wiki_page][:name]).
                 where("id <> '#{wp.id}'").empty?