aguo/ruki/app/controllers/wiki_controller.rb

SELECT "wiki_pages".* FROM "wiki_pages" WHERE "wiki_pages"."name" = 'HomePage' AND "wiki_pages"."project_id" = 1 LIMIT 1
---
  def page
    logger.error "!!#{params[:id]}"
    unless params[:id].nil?
      #@wiki_page = WikiPages.where(:project_id => params[:project_id], :name => params[:id])
      @wiki_page = WikiPages.find_by_project_id_and_name(params[:project_id], params[:id])

SELECT "wiki_pages".* FROM "wiki_pages" WHERE "wiki_pages"."name" = 'HomePage' LIMIT 1
SELECT "wiki_revisions".* FROM "wiki_revisions" WHERE "wiki_revisions"."page_id" = 1 AND "wiki_revisions"."revision" = 2 LIMIT 1
---
  def revision_page
    unless params[:rid].nil?
      @wiki_page = WikiPages.find_by_name(params[:id])
      @revision = WikiRevisions.find_by_page_id_and_revision(@wiki_page.id, params[:rid])

SELECT "wiki_pages".* FROM "wiki_pages" WHERE "wiki_pages"."project_id" = 1 LIMIT 1
---
  def lists
    logger.error "!##{params[:project_id]}"
    @wiki_pages = WikiPages.where(:project_id => params[:project_id])

SELECT "wiki_pages".* FROM "wiki_pages" WHERE "wiki_pages"."name" = 'HomePage' AND "wiki_pages"."project_id" = 1 LIMIT 1
---
  def add
    @wiki_page = WikiPages.find_by_project_id_and_name(params[:project_id], params[:id])

SELECT "wiki_pages".* FROM "wiki_pages" WHERE "wiki_pages"."name" = 'HomePage' AND "wiki_pages"."project_id" = 1 LIMIT 1
INSERT INTO "wiki_pages" ("locked_at", "content", "locked_by", "project_id", "revised_by", "revised_at", "revision", "name", "updated_at", "created_at") VALUES (NULL, '', NULL, 1, 'Guest', '2011-08-30 08:26:59.596768', NULL, 'test', '2011-08-30 08:26:59.597313', '2011-08-30 08:26:59.597313')
INSERT INTO "wiki_revisions" ("updated_at", "revision", "page_id", "created_at", "revised_by", "revised_at", "content") VALUES ('2011-09-07 09:44:40.537773', 1, 1, '2011-09-07 09:44:40.537773', NULL, NULL, '=h1--aguo=
UPDATE "wiki_pages" SET "content" = 'test', "revised_at" = '2011-08-30 08:27:34.948981', "updated_at" = '2011-08-30 08:27:34.949664' WHERE "wiki_pages"."id" = 2
---
  def edit
    #logger.error "!!#{params[:id]}"
    @wiki_page = WikiPages.find_by_project_id_and_name(params[:project_id], params[:id])
    if @wiki_page.nil?
      @wiki_page = WikiPages.new
      @wiki_page.name = params[:id]
      @wiki_page.content = params[:wiki_page][:content] unless params[:wiki_page].nil?
    end
    if request.post?
      if params[:submit_preview]
        @wiki_html = Wikitext::Parser.new.parse(params[:wiki_page][:content])
      else params[:submit_save]
        p = @wiki_page
        p.project_id = params[:project_id]
        p.name = params[:wiki_page][:name] if params[:wiki_page][:name]
        p.content = params[:wiki_page][:content]
        p.revision = (p.revision || 0) + 1
        p.revised_at = Time.now
        p.revised_by = 'Guest'
        p.save

SELECT "wiki_pages".* FROM "wiki_pages" WHERE "wiki_pages"."name" = 'HomePage' LIMIT 1
SELECT "wiki_revisions".* FROM "wiki_revisions" WHERE "wiki_revisions"."page_id" = 1
---
  def revisions
    pid = WikiPages.find_by_name(params[:id]).id
    @revisions = WikiRevisions.where(:page_id => pid)